[
    {
        "modalTitle": "Microsoft Certified: Azure",
        "modalSubtitle":"SC900, AZ900, DB900, AI900, MS900",
        "modalDate": "May 2022 to Now",
        "modalContent": ["Knowledge of fundamentals of security, compliance and Identity across Azure", "Demonstrated understanding of core data concepts and related Azure data services", "Proven knowledge of cloud concepts, Azure services, workloads and architecture", "Understand link between Microsoft365 products and common organizational IT challenges."]
    },
    {
        "modalTitle": "Post Graduate Certificate in IT",
        "modalSubtitle":"University of Auckland",
        "modalDate": "January 2023 to Now",
        "modalContent": ["Client-side, sever-side, database, web-application and mobile development design and technologies", "Developing software using OOP language features, and contemporary APIs, frameworks and tools.", "Developing Dynamic Web-based applications involving relational databases.", "Developing software using OOP language features, and contemporary APIs, frameworks and tools."]
    },
    {
        "modalTitle": "Cisco Certified Network Associate",
        "modalSubtitle":"CCNA 201 - 300",
        "modalDate": "March 2023 to May 2023",
        "modalContent": ["Core Networking fundamentals, including connectivity, LAN, WAN and troubleshooting", "Practical knowledge of TCP/IP/OSI Networking model and related protocols", "Ability to build effective, secure modern and networks for a wide range of organisations", "Understand the relationship of routers, switches, moderms, servers and hosts communicating on a network"]
    },
    {
        "modalTitle": "Programming Bootcamps",
        "modalSubtitle":"Complete Web Development Bootcamp - Dr Angela Yu",
        "modalDate": "November 2021 to April 2022", 
        "modalContent": ["Developed range of high-quality Full-Stack MERN Applications", "Created eye-catching websites with Bootstrap, CSS & HTML", "Deep understand of SDLC, SEO, APIs and other fundamentals", "Ability using Command Line tools, Chrome Developer Tools and Git to effectively manage projects" ]
    }, 
    {
        "modalTitle": "Programming Bootcamps",
        "modalSubtitle":"100 Days of Code - Dr Angela Yu",
        "modalDate": "July 2021 to November 2021",
        "modalContent": ["Created user-friendly static webistes with Flask, Bootstrap, HTML and CSS", "Developed desktop applications, GUIs and games using DRY and OOP principles", "Able to use Pandas, Plotly and Matplotlib libraries to clean, analyse and display data", "Scraping data, automating and testing with BS2 and Selenium libraries"]
    }, 
    {
        "modalTitle": "University Education",
        "modalSubtitle":"Post-Graduate Diploma in Teaching - University of Auckland",
        "modalDate": "January 2020 to December 2020",
        "modalContent": ["Developed communication, leadership, public speaking and classroom management skills on practical teacher training", "Deepened knowledge in key areas such as Literacy, Mathematics, Te Reo Maori, ICT and the Philosphy of Teaching", "Able to design and implement effective curriculum in core curriculum areas"]
    },
    {
        "modalTitle": "University Education",
        "modalSubtitle":"BSC of Psychology - Massey University",
        "modalDate": "January 2013 to December 2015",
        "modalContent": ["Developed an understanding of design thinking and the design process for web development.", "Practical skills creating websites and web applications using HTML, CSS and JQuery.", "Created algorithms such as searching, sorting, and tree traversals to solve problems.", "Understanding of fundamental data structures such as stacks, queues, linked-lists, binary trees."]
    }
]