[
    {
        "modalTitle": "Post-Graduate Certification in IT",
        "modalSubtitle": "University of Auckland",
        "modalDate": "January 2023 to Now",
        "modalContent": [
            "Client-side, server-side, database, web-application and mobile development design and technologies",
            "Developing software using OOP language features, and contemporary APIs, frameworks and tools.",
            "Developing Dynamic Web-based applications involving relational databases.",
            "Developing software using OOP language features, and contemporary APIs, frameworks and tools."
        ]
    },
    {
        "modalTitle": "Microsoft Certified: Azure",
        "modalSubtitle": "SC900, AZ900, DB900, AI900, MS900",
        "modalDate": "May 2022 to October 2022",
        "modalContent": [
            "Knowledge of fundamentals of security, compliance and Identity across Azure",
            "Demonstrated understanding of core data concepts and related Azure data services",
            "Proven knowledge of cloud concepts, Azure services, workloads and architecture",
            "Understand link between Microsoft 365 products and common organizational IT challenges."
        ]
    },
    {
        "modalTitle": "BSC of Psychology",
        "modalSubtitle": "Massey University",
        "modalDate": "2015",
        "modalContent": [
            "Proficient applying psychological perspectives to better understand organizational challenges.",
            "Demonstrated expertise in regression, experimental design, model selection, and time series data analysis.",
            "Adapt applying skills such as discrete probability, continuous distributions, likelihood, estimation, and hypothesis testing.",
            "Effective at interpreting and critically communicating statistical findings."
        ]
    },
    {
        "modalTitle": "Programming Bootcamps",
        "modalSubtitle": "Complete Web Development Bootcamp - Dr Angela Yu",
        "modalDate": "November 2021 to April 2022",
        "modalContent": [
            "Developed and deployed high-quality Full-Stack MERN Applications",
            "Created eye-catching websites with Bootstrap, CSS & HTML",
            "Deepend understanding of fundamentals such as SDLC, SEO and API and programming best practices",
            "Able to use command prompt, Chrome Developer Tools and Git to develop and manage projects"
        ]
    },
    {
        "modalTitle": "University Education",
        "modalSubtitle": "Post-Graduate Diploma in Teaching - University of Auckland",
        "modalDate": "January 2020 to December 2020",
        "modalContent": [
            "Developed communication, leadership, public speaking and classroom management skills on practical teacher training",
            "Deepened knowledge in key areas such as Literacy, Mathematics, Te Reo Maori, ICT and the Philosphy of Teaching",
            "Able to design and implement effective curriculum in core curriculum areas"
        ]
    }
]